tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
brew  "1password-cli"
brew "aom"
brew "arc"
brew "autoconf"
brew "bat"
brew "bottom"
brew "brotli"
brew "btop"
brew "cmake"
brew "cmake-docs"
brew "cmark-gfm"
brew "coreutils"
brew "curl"
brew "duf"
brew "emscripten"
brew "exercism"
brew "fd"
brew "flyctl"
brew "fwup"
brew "fzf"
brew "gdu"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "glances"
brew "gnupg"
brew "gobject-introspection"
brew "grep"
brew "guile"
brew "imagemagick"
brew "jasper"
brew "jpeg-xl"
brew "lazygit"
brew "libheif"
brew "libraw"
brew "librsvg"
brew "lsd"
brew "mhanberg/tap/lazyasdf"
brew "mise"
brew "navi"
brew "neovim"
brew "node"
brew "openldap"
brew "openssl@3"
brew "pandoc"
brew "pkg-config"
brew "postgresql@14"
brew "python@3.11"
brew "python@3.9"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "squashfs"
brew "stylelint"
brew "tldr"
brew "tre-command"
brew "tree-sitter"
brew "webp"
brew "wxwidgets"
brew "xz"
brew "zoxide"
brew "zsh-syntax-highlighting"
cask "1password"
cask "arduino-ide"
cask "cron"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "karabiner-elements"
cask "raycast"
cask "slack"
cask "telegram"
cask "visual-studio-code"
cask "warp"
cask "whatsapp"
