tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
brew  "1password-cli"
brew "atuin"
# brew "aom"            # media lib (imagemagick dep) — pruned
# brew "arc"            # second browser — pruned (keeping chrome)
brew "autoconf"
brew "bat"
# brew "bottom"         # redundant monitor — pruned (keeping btop)
# brew "brotli"         # transitive dep — pruned (auto-installed if needed)
brew "btop"
brew "cmake"
# brew "cmake-docs"    # offline cmake docs — pruned
# brew "cmark-gfm"      # transitive dep — pruned
brew "coreutils"
brew "curl"
# brew "duf"            # disk tool — pruned
# brew "emscripten"     # embedded/wasm — pruned
# brew "exercism"      # exercism.io CLI — pruned
brew "fd"
brew "flyctl"
# brew "fwup"           # embedded/Nerves — pruned
brew "fzf"
# brew "gdu"            # disk tool — pruned
brew "gh"
# brew "ghostscript"    # media lib — pruned
brew "git"
brew "git-delta"
# brew "glances"        # redundant monitor — pruned (keeping btop)
brew "gnupg"
# brew "gobject-introspection"  # transitive dep — pruned
brew "grep"
# brew "guile"         # Scheme interpreter (emacs/imagemagick dep) — pruned
# brew "imagemagick"    # media — pruned
# brew "jasper"         # media lib — pruned
# brew "jpeg-xl"        # media lib — pruned
brew "lazygit"
# brew "libheif"        # media lib — pruned
# brew "libraw"         # media lib — pruned
# brew "librsvg"        # media lib — pruned
brew "lsd"
brew "mhanberg/tap/lazyasdf"
brew "mise"
# brew "navi"          # cheatsheet tool — pruned
brew "neovim"
# brew "openldap"      # LDAP libs (transitive dep) — pruned
brew "openssl@3"
# brew "pandoc"        # doc converter — pruned
brew "pkg-config"
# brew "postgresql@14" # replaced by Postgres.app (cask "postgres-app")
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "starship"
# brew "squashfs"       # embedded/Nerves — pruned
# brew "stylelint"     # CSS linter — pruned (use per-project via npm/mise)
brew "television"
brew "tldr"
brew "tre-command"
# brew "tree-sitter"   # CLI — pruned (neovim ships its own parsers)
# brew "webp"           # media lib — pruned
# brew "wxwidgets"      # GUI toolkit (erlang :observer) — pruned; see note
# brew "xz"             # transitive dep — pruned (auto-installed if needed)
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "1password"
# cask "arduino-ide"    # pruned
cask "cron"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "karabiner-elements"
cask "postgres-app"
cask "raycast"
cask "slack"
cask "telegram"
cask "visual-studio-code"
cask "warp"
cask "whatsapp"
