tap "zimakki/tap"

brew "agent-browser"
brew "atuin"
brew "autoconf"
brew "bat"
brew "btop"
brew "cmake"
brew "coreutils"
brew "curl"
brew "diff-so-fancy"
brew "fd"
brew "flyctl"
brew "fop" # Erlang documentation build (KERL_BUILD_DOCS=yes)
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "gnupg"
brew "grep"
brew "hunk"
brew "lazygit"
brew "libxslt" # Erlang documentation build (xsltproc)
brew "lsd"
brew "mermaid-cli"
# mise owns language runtimes; do not add Homebrew node/python entries.
brew "mise"
brew "neovim"
brew "openssl@3"
brew "pkg-config"
brew "postgis" # PostgreSQL itself comes from Postgres.app.
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "television"
brew "tldr"
brew "tree"
brew "tre-command"
brew "tree-sitter@0.25" # Keep aligned with Neovim parser compatibility.
brew "yazi"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

cask "1password"
cask "1password-cli"
cask "cmux"
cask "codex"
cask "discord"
cask "font-hack-nerd-font"
cask "font-inter"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "karabiner-elements"
cask "meru"
cask "ngrok"
cask "notion-calendar"
cask "postgres-app"
cask "raycast"
cask "slack"
cask "telegram"
cask "visual-studio-code"
cask "warp"
cask "whatsapp"
cask "wispr-flow"
cask "zed@preview"
cask "zimakki/tap/inkwell"
